hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
/**
 * @file afsk.c
 *
 * @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
 * @date 2026
 * @copyright GNU General Public License v3
 * @see https://github.com/hiperiondev/esp32idf_APRS
 *
 * @note
 * This is based on other projects:
 *     VP-Digi: https://github.com/sq8vps/vp-digi
 *     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
 *     LibAPRS: https://github.com/markqvist/LibAPRS
 *
 *     please contact their authors for more information.
 *
 * @brief ESP-IDF hardware abstraction layer implementation for the AFSK modem:
 * free-running continuous ADC (DMA) receive path, GPTimer-driven one-shot DAC
 * transmit path, and PTT / TX / RX GPIO handling.
 */

#include <inttypes.h>
#include <math.h>
#include <stdlib.h>
#include <string.h>

#include "driver/dac_oneshot.h"
/*
 * driver/gpio.h for gpio_config()/gpio_set_level()/gpio_num_t, used by the
 * MODEM_PTT_GPIO / MODEM_LED_TX_GPIO / MODEM_LED_RX_GPIO blocks below. Those
 * three pins default to -1 in esp32idf_radioamateur_modem_config.h, so each
 * #if MODEM_*_GPIO >= 0 block that touches the GPIO API is compiled in only
 * when its pin is assigned a real value - as this project does for PTT, from
 * the top-level CMakeLists.txt.
 *
 * MODEM_PTT_GPIO in particular is a fixed, compile-time-only board wiring
 * choice - an internal radiomodem feature, exactly like MODEM_ADC_GPIO /
 * MODEM_DAC_GPIO - and is not exposed as a runtime/web-admin setting.
 */
#include "driver/gpio.h"
#include "driver/gptimer.h"
/* gpio_ll_set_level(): direct out-register write, always-inline and therefore
 * IRAM-safe. gpio_set_level() from driver/gpio.h lives in flash, so it must
 * never be called from setPtt()/LED_Status2(), which run in the DAC ISR while
 * the flash cache can be disabled by a concurrent flash read. */
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_continuous.h"
#include "esp_attr.h"
#include "esp_idf_version.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "hal/gpio_ll.h"
#include "sdkconfig.h"
#include "soc/soc_caps.h"

#include "afsk.h"
#include "ax25.h"
#include "esp32idf_radioamateur_modem_config.h"
#include "modem.h"

#ifdef ENABLE_FX25
#include "fx25.h"
#endif

static const char *TAG = "afsk";

/* ------------------------------------------------------------------ */
/* RX sample ring buffer                                              */
/* ------------------------------------------------------------------ */

/*
 * Reassembly buffer between adc_ingest() and AFSK_Poll(). Both run in
 * afsk_rx_task, so this is a plain single-threaded queue; it exists only
 * because adc_continuous_read() may hand back a partial frame and AFSK_Poll()
 * wants whole MODEM_BLOCK_SIZE blocks.
 *
 * The sample copy runs entirely at task priority, out of interrupt context:
 * the ADC callback does nothing but count samples (see adc_conv_done_cb), and
 * afsk_rx_task blocks in adc_continuous_read() and does the work where taking
 * as long as it likes costs the modulator nothing. Keeping the copy off the
 * DAC clock's interrupt level (level 3) matters: a contiguous blackout of that
 * timer longer than about 4-6 sample periods (~100-150 us) freezes the
 * modulator mid-symbol at every baud rate, because the phase accumulator and
 * the symbol counter both stop and the resulting step in the waveform is not
 * something a tracking loop can follow. A uniform rate of missed DAC alarms,
 * by contrast, is harmless - the demodulator's DPLL tracks it and every frame
 * still decodes.
 *
 * MODEM_RX_FIFO_SIZE must be a power of two so the index is a mask, not a
 * modulo of a wrapping counter.
 */
_Static_assert((MODEM_RX_FIFO_SIZE & (MODEM_RX_FIFO_SIZE - 1)) == 0, "MODEM_RX_FIFO_SIZE must be a power of two");

#define RB_MASK (MODEM_RX_FIFO_SIZE - 1)

typedef struct {
    int16_t buffer[MODEM_RX_FIFO_SIZE];
    volatile uint32_t head; /* written by adc_ingest() only */
    volatile uint32_t tail; /* written by AFSK_Poll() only */
} RingBuffer;

static RingBuffer s_fifo;

/* Deferred flush. AFSK_FlushFifo() is called from the service task and from
 * afskSetModem(), neither of which is the consumer; letting them write tail
 * directly would put two writers on it and break the single-consumer invariant.
 * They raise a flag instead and AFSK_Poll() does the work between blocks. */
static volatile bool s_flushReq = false;

static inline void rb_init(RingBuffer *rb) {
    rb->head = 0;
    rb->tail = 0;
}

static inline uint32_t rb_size(const RingBuffer *rb) {
    return rb->head - rb->tail; /* unsigned: correct across the wrap */
}

static bool rb_pop(RingBuffer *rb, int16_t *data) {
    uint32_t tail = rb->tail;

    if ((rb->head - tail) == 0)
        return false;

    *data = rb->buffer[tail & RB_MASK];
    __sync_synchronize(); /* read the sample before publishing the new tail */
    rb->tail = tail + 1;
    return true;
}

void AFSK_FlushFifo(void) {
    s_flushReq = true;
}

/* ------------------------------------------------------------------ */
/* State                                                              */
/* ------------------------------------------------------------------ */

static adc_continuous_handle_t s_adc = NULL;
static adc_cali_handle_t s_cali = NULL;
static dac_oneshot_handle_t s_dac = NULL;
static gptimer_handle_t s_dacTimer = NULL;
static TaskHandle_t s_rxTask = NULL;
static volatile bool s_rxStop = false;   /* asks afsk_rx_task to exit */
static volatile bool s_rxExited = false; /* set by afsk_rx_task on the way out */

static volatile bool s_txActive = false;
static volatile bool s_txStopPending = false;
static volatile bool s_fullDuplex = true;
static bool s_dacTimerRunning = false;
static bool s_inited = false;

static volatile uint32_t s_adcSamples = 0; /* total samples produced by the ADC */
static float s_dacAlarmRateHz = 0.0f;      /* rate the alarm really fires at */

/* diagnostic capture tap (raw ADC samples, still used by main/aprs_service.c) */
static int16_t *volatile s_capRaw = NULL;
static volatile int s_capRawLen = 0;
static volatile int s_capRawIdx = 0;

static float s_audio[MODEM_BLOCK_SIZE];
static float s_agcGain = 1.0f;

static int s_offset = 0; /* DC offset of the input, in mV */
static int s_mVrms = 0;  /* last RMS reading, in mV */
static uint8_t s_dcdCnt = 0;

/* Running DC average of the raw ADC stream (replaces the tcb_t of the original). */
#define AVG_N 125
static uint16_t s_avgBuf[AVG_N];
static uint8_t s_avgIdx = 0;
static int s_avgSum = 0;
static uint16_t s_avg = 2048;

