hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
/* DAC idle/centre code and amplitude scaling.
 *
 * IRAM_ATTR: called directly from dac_timer_isr(), which is itself IRAM_ATTR.
 * A plain "static inline" is only a hint - at CONFIG_COMPILER_OPTIMIZATION_DEBUG
 * (-Og), GCC frequently declines it, and an un-inlined static function is
 * placed in flash by default. That reintroduces the exact XIP-fetch jitter
 * this file's other ISR-path functions (dac_write_isr, calculateCRC,
 * ModemSinSample) were already made IRAM_ATTR to avoid. */
#define DAC_MID 128
static inline uint8_t IRAM_ATTR dac_scale(uint8_t s) {
    int v = DAC_MID + (((int)s - DAC_MID) * MODEM_DAC_AMPLITUDE_PCT) / 100;
    if (v < 0)
        v = 0;
    if (v > 255)
        v = 255;
    return (uint8_t)v;
}

/* ------------------------------------------------------------------ */
/* AGC / resampler                                                    */
/* ------------------------------------------------------------------ */

#define AGC_TARGET_RMS 0.2f /* target RMS level (-10 dBFS) */

/* Attack = gain coming DOWN because the signal is too loud. It must be fast:
 * an overdriven demodulator decodes nothing. Release = gain going UP on a quiet
 * signal, and must be slow so noise between frames does not pump the gain.
 * The original had these two the wrong way round. */
#define AGC_ATTACK   0.05f
#define AGC_RELEASE  0.002f
#define AGC_MAX_GAIN 8.0f
#define AGC_MIN_GAIN 0.1f

/* Below this block RMS there is nothing but ADC noise, so there is no
 * meaningful level to track. */
#define AGC_SQUELCH_RMS 0.01f

/* Most the gain may change in a single 20 ms block. Without this a single
 * near-silent block drives error towards infinity and slams the gain to the
 * rail in one step. */
#define AGC_MAX_STEP 2.0f

/**
 * @brief Track the input level.
 *
 * Only call this when a signal is actually present. Between frames the DAC is
 * parked at mid-scale and the DC tracker removes it, so the block RMS is
 * essentially zero; adapting on that would compute AGC_TARGET_RMS/~0, peg the
 * gain at AGC_MAX_GAIN, and hand the next transmission to the demodulator
 * roughly 10x overdriven - well past the 13 bits demodulate() accepts, which
 * overflows the int32 accumulator in filterRun() (the 15-tap AFSK300 BPF is the
 * first to go) and wraps the int16 cast on the correlator output, inverting the
 * symbol decision, so every profile would decode zero frames.
 */
static float update_agc(const float *buf, size_t len) {
    float sum_sq = 0;
    for (size_t i = 0; i < len; i++)
        sum_sq += buf[i] * buf[i];

    float rms = sqrtf(sum_sq / (float)len);
    if (rms < AGC_SQUELCH_RMS)
        return s_agcGain; /* noise only - hold the gain where it is */

    float error = AGC_TARGET_RMS / rms;
    if (error > AGC_MAX_STEP)
        error = AGC_MAX_STEP;
    else if (error < 1.0f / AGC_MAX_STEP)
        error = 1.0f / AGC_MAX_STEP;

    float rate = (error < 1.0f) ? AGC_ATTACK : AGC_RELEASE;

    s_agcGain += (s_agcGain * error - s_agcGain) * rate;
    s_agcGain = fmaxf(fminf(s_agcGain, AGC_MAX_GAIN), AGC_MIN_GAIN);
    return s_agcGain;
}

/* Anti-alias FIR for the MODEM_ADC_SAMPLERATE -> 9600 Hz decimation.
 *
 * The cutoff is fixed by the job: 4800 Hz, the 9600 Hz Nyquist. The LENGTH is
 * not - it is set by the ratio, because the cutoff is what matters in NORMALISED
 * terms and that halves when the input rate doubles. The 8-tap set below was cut
 * for 38400 -> 9600 (4:1, normalised cutoff 0.125). Reusing it at 76800 -> 9600
 * (8:1, normalised 0.0625) does not filter, it just picks every eighth output of
 * a filter that is now twice too wide, and the AFSK profiles alias into
 * unintelligibility - verified on the host, 48 % BER.
 *
 * So the taps follow the ratio. Both sets are Hamming-windowed sincs at 4800 Hz
 * and both are host-verified to give 0 bit errors on Bell202, V.23 and AFSK300.
 */
#if MODEM_RESAMPLE_RATIO == 8
#define FILTER_TAPS 16
static const float resample_coeffs[FILTER_TAPS] = {
    0.000813f, 0.004002f, 0.013722f, 0.033895f, 0.064417f, 0.100105f, 0.132060f, 0.150986f,
    0.150986f, 0.132060f, 0.100105f, 0.064417f, 0.033895f, 0.013722f, 0.004002f, 0.000813f,
};
#elif MODEM_RESAMPLE_RATIO == 4
#define FILTER_TAPS 8
static const float resample_coeffs[FILTER_TAPS] = {
    0.003560f, 0.038084f, 0.161032f, 0.297324f, 0.297324f, 0.161032f, 0.038084f, 0.003560f,
};
#elif MODEM_RESAMPLE_RATIO == 1
#define FILTER_TAPS 1
static const float resample_coeffs[FILTER_TAPS] = { 1.0f };
#else
#error "No decimation FIR for this MODEM_RESAMPLE_RATIO. Cut one at 4800 Hz for the new ratio; do not reuse a filter designed for a different one."
#endif

static void resample_audio(float *buf) {
    for (int i = 0; i < MODEM_BLOCK_SIZE / MODEM_RESAMPLE_RATIO; i++) {
        float sum = 0;
        for (int j = 0; j < FILTER_TAPS; j++) {
            int index = i * MODEM_RESAMPLE_RATIO + j;
            if (index < MODEM_BLOCK_SIZE)
                sum += buf[index] * resample_coeffs[j];
        }
        buf[i] = sum;
    }
}

/* ------------------------------------------------------------------ */
/* LEDs / PTT                                                         */
/* ------------------------------------------------------------------ */

static uint8_t r_old = 0, g_old = 0, b_old = 0;
static int64_t rgbTimeout = 0;

/* PTT pin is a fixed compile-time constant (::MODEM_PTT_GPIO, an internal
 * radiomodem feature - like ::MODEM_ADC_GPIO / ::MODEM_DAC_GPIO it is not
 * runtime/web-admin selectable). Its active level is likewise fixed at
 * compile time (::MODEM_PTT_ACTIVE_HIGH) and is not a user-facing polarity
 * toggle - AFSK_setPttActiveHigh() is only ever called with that same
 * compile-time value, from modem_init()/modem_set_modem(), including once
 * live per Radio-page Save (aprs_service_apply_modem_config()) as part of
 * re-applying the whole modem config.
 *
 * s_pttActiveHigh is read from setPtt(), which runs from the DAC timer ISR
 * (IRAM_ATTR, fires continuously during TX) - so any change to it from task
 * context must be made atomic with respect to that ISR. s_pttMux guards
 * exactly that variable; it must never be held around gpio_set_level(), which
 * is not guaranteed ISR-safe on this target. */
static const int8_t s_pttGpio = MODEM_PTT_GPIO;
static bool s_pttActiveHigh = MODEM_PTT_ACTIVE_HIGH ? true : false;
static portMUX_TYPE s_pttMux = portMUX_INITIALIZER_UNLOCKED;

bool afsk_gpio_is_output_capable(int8_t gpio) {
    if (gpio == -1)
        return true; /* "disabled" is always accepted */
    if (gpio < 0 || gpio > 39)
        return false;
    if (gpio >= 34 && gpio <= 39)
        return false; /* input-only, cannot drive an output */
    if (gpio >= 6 && gpio <= 11)
        return false; /* internal SPI flash/PSRAM, not brought out */
    return true;
}

bool afsk_ptt_gpio_is_valid(int8_t gpio) {
    if (gpio == -1)
        return true; /* "disabled" is always accepted */
    if (!afsk_gpio_is_output_capable(gpio))
        return false;
    if (gpio == MODEM_ADC_GPIO || gpio == MODEM_DAC_GPIO)
        return false; /* already used by the audio front end */
    return true;
}

