hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
void AFSK_setPttActiveHigh(bool active_high) {
    /* setPtt() (IRAM ISR, driven by the DAC timer during TX) reads
     * s_pttActiveHigh on every bit and calls gpio_set_level() on the fixed
     * s_pttGpio pin - it does not know a Save is in progress. The pin itself
     * never changes (it is the compile-time ::MODEM_PTT_GPIO constant), so
     * there is no pin swap to sequence here: only the polarity is updated,
     * under the same spinlock setPtt() uses.
     *
     * The idle level is re-driven here only when nothing is transmitting. The
     * DAC-timer ISR already owns the pin throughout TX and re-asserts the
     * correct level (active or idle, per the current s_pttActiveHigh) on every
     * sample via setPtt(), so while TX is active the write is skipped and any
     * change is applied by setPtt() itself on the very next bit. */
    portENTER_CRITICAL(&s_pttMux);
    s_pttActiveHigh = active_high;
    portEXIT_CRITICAL(&s_pttMux);

    if (s_inited && s_pttGpio >= 0 && !getTransmit())
        gpio_set_level((gpio_num_t)s_pttGpio, active_high ? 0 : 1);
}

/* IRAM_ATTR: reachable from dac_timer_isr() (IRAM ISR) via setPtt(), which
 * runs setPtt(false) directly from Ax25GetTxBit() at key-down. If this ever
 * executes while a concurrent flash op (e.g. LittleFS reading bulletins.json)
 * has cache disabled, a flash-resident function here panics with
 * "Cache disabled but cached memory region accessed". */
void IRAM_ATTR LED_Status2(uint8_t r, uint8_t g, uint8_t b) {
    int64_t now = esp_timer_get_time() / 1000;

    if (r == r_old && g == g_old && b == b_old) {
        /* Same state as last time: nothing to drive, just keep pushing the
         * "quiet" window out so a burst of identical calls (e.g. once per
         * transmitted bit) does not repeatedly touch the GPIOs. This must
         * NOT gate genuine transitions below - see the note there. */
        rgbTimeout = now + 100;
        return;
    }

    /* A genuine state change (this is what setPtt() uses to reflect PTT
     * on/off). A real transition is always applied: packets are transmitted
     * one at a time with a real PTT-off in between (see Ax25TransmitCheck()),
     * and back-to-back packets in a burst can toggle PTT on/off/on again well
     * within 100 ms, so this LED (and anything wired the same way, e.g. a PTT
     * relay) must follow the real GPIO, which is driven separately by
     * setPtt(). Only the 100 ms window before the NEXT transition is rate-
     * limited, and only for repeats of this same new state. */
    rgbTimeout = now + 100;
    r_old = r;
    g_old = g;
    b_old = b;

#if MODEM_LED_TX_GPIO >= 0
    gpio_ll_set_level(&GPIO, (uint32_t)MODEM_LED_TX_GPIO, r > 0);
#endif
#if MODEM_LED_RX_GPIO >= 0
    gpio_ll_set_level(&GPIO, (uint32_t)MODEM_LED_RX_GPIO, g > 0);
#endif
}

/* IRAM_ATTR: called from dac_timer_isr() -> MODEM_BAUDRATE_TIMER_HANDLER() ->
 * Ax25GetTxBit() at key-down (setPtt(false)), same ISR context as the rest of
 * the TX path. Must stay flash-cache-safe for the same reason as
 * LED_Status2() above. */
void IRAM_ATTR setPtt(bool state) {
    /* s_pttGpio is a compile-time constant (::MODEM_PTT_GPIO), so only the
     * polarity needs to be snapshotted under the spinlock
     * AFSK_setPttActiveHigh() uses - short enough to be fine from IRAM/ISR
     * context, and it can never observe a half-applied change. */
    portENTER_CRITICAL_ISR(&s_pttMux);
    bool activeHigh = s_pttActiveHigh;
    portEXIT_CRITICAL_ISR(&s_pttMux);

    if (s_pttGpio >= 0)
        gpio_ll_set_level(&GPIO, (uint32_t)s_pttGpio, activeHigh ? state : !state);
    if (state)
        LED_Status2(255, 0, 0);
    else
        LED_Status2(0, 0, 0);
}

bool getTransmit(void) {
    return s_txActive;
}

/* Diagnostic-only: reads back the ACTUAL physical level currently on the PTT
 * pin, straight from the GPIO input register - not the logical s_txActive/
 * setPtt() state that everything else in this file trusts. Used by
 * pollTxEvents() in ax25.c so the "PTT OFF (unkeyed)" / "PTT ON (keyed up)"
 * log lines report ground truth from the pin itself instead of only the
 * software's belief about it, which is what every other log in this path
 * already does. Returns -1 if no PTT pin is configured. Safe to call from
 * task context (this is not IRAM/ISR code). */
int afskGetPttGpioLevel(void) {
    if (s_pttGpio < 0)
        return -1;
    return gpio_get_level((gpio_num_t)s_pttGpio);
}

/* Diagnostic-only: the currently configured PTT polarity, so a log line can
 * say what pin level actually means ("idle" vs "asserted") instead of
 * leaving that to be looked up in CMakeLists.txt. Mirrors s_pttActiveHigh
 * under the same spinlock setPtt() uses. */
bool afskGetPttActiveHigh(void) {
    portENTER_CRITICAL(&s_pttMux);
    bool activeHigh = s_pttActiveHigh;
    portEXIT_CRITICAL(&s_pttMux);
    return activeHigh;
}

bool AFSK_TxTeardownPending(void) {
    return s_txStopPending;
}

/**
 * @brief Key up / key down.
 *
 * setTransmit(true) is only ever reached from ModemTransmitStart(), i.e. task
 * context, so the timer may be started here. setTransmit(false) is reached from
 * the DAC ISR via Ax25GetTxBit() -> ModemTransmitStop(), so it must do nothing
 * more than lower a flag; AFSK_ServiceTx() finishes the job from a task.
 */
void IRAM_ATTR setTransmit(bool val) {
    if (val) {
        if (!s_txActive) {
            s_txStopPending = false;
            s_txActive = true;
            if (s_dacTimer && !s_dacTimerRunning) {
                gptimer_start(s_dacTimer);
                s_dacTimerRunning = true;
            }
        }
    } else {
        s_txActive = false;
        /* Drop the PTT GPIO right here, at key-down. This is the only teardown
         * step that is safe to run from the DAC ISR: setPtt() is IRAM_ATTR and
         * does nothing heavier than a spinlock-guarded gpio_set_level() (the
         * status LED it also touches is compiled out when MODEM_LED_*_GPIO are
         * -1). The rest of the teardown - stopping the DAC sample timer,
         * parking the DAC, flushing the RX FIFO - is NOT ISR-safe and stays
         * deferred to AFSK_ServiceTx() via s_txStopPending below.
         *
         * The pin drop must NOT be deferred with it: AFSK_ServiceTx() runs at
         * most once per service-task period (>= 1 tick) and behind an unbounded
         * RX-drain loop, so deferring the pin left the PTT line physically
         * asserted for up to a whole tick after the transmitter had already
         * stopped modulating (s_txActive == false). During that window the real
         * PTT GPIO did not match the logical TX state, and "PTT OFF (unkeyed)"
         * could be reached while the pin was still keyed. Releasing it at
         * key-down keeps the physical PTT in lock-step with key-down. The
         * (now idempotent) setPtt(false) in AFSK_ServiceTx() is kept as a
         * belt-and-suspenders re-assertion of the idle level. */
        setPtt(false);
        s_txStopPending = true;
    }
}

