hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
void afskSetFullDuplex(bool enable) {
    s_fullDuplex = enable;
    Ax25Config.fullDuplex = enable ? 1 : 0;
}

uint16_t afskGetRms(void) {
    return (uint16_t)s_mVrms;
}

uint32_t afskGetAdcSampleCount(void) {
    return s_adcSamples;
}

int afskGetDcOffset(void) {
    return s_offset;
}

float afskGetAgcGain(void) {
    return s_agcGain;
}

float afskGetDacAlarmRate(void) {
    return s_dacAlarmRateHz;
}

void afskDiagDacWrite(uint8_t code) {
    if (s_txActive || !s_dac)
        return;
    dac_oneshot_output_voltage(s_dac, code);
}

int afskDiagCaptureRaw(int16_t *dst, int n, uint32_t timeout_ms) {
    s_capRawIdx = 0;
    s_capRawLen = n;
    s_capRaw = dst;

    uint32_t waited = 0;
    while ((s_capRawIdx < n) && (waited < timeout_ms)) {
        vTaskDelay(pdMS_TO_TICKS(5) ? pdMS_TO_TICKS(5) : 1);
        waited += 5;
    }
    int got = s_capRawIdx;
    s_capRaw = NULL;
    return got;
}

/* ------------------------------------------------------------------ */
/* DAC timer ISR                                                      */
/* ------------------------------------------------------------------ */

/*
 * Why the sample ISR writes the DAC register directly.
 *
 * dac_oneshot_output_voltage() is ISR safe in the sense that matters for
 * correctness - a NULL check and one register write inside
 * DAC_RTC_ENTER_CRITICAL_SAFE(), no logging - but it lives in FLASH. Every call
 * from this ISR is a potential instruction-cache miss, and an XIP fetch off the
 * SPI flash costs tens of microseconds. That is not a rate error: the GPTimer
 * alarm is scheduled on an absolute count, so a late ISR emits one sample late
 * and the next is back on schedule. It is pure jitter on the transmitted edge,
 * which is why stage 2 reports "missed alarms +0.00 %" while also reporting a
 * 38 us worst-case gap against a 26.0 us period - about 12 us of excess.
 *
 * 12 us is 1.4 % of a Bell202 symbol and the AFSK profiles never notice it. It
 * is 12 % of a G3RUH symbol (104 us, four DAC samples), and a symbol edge that
 * moves by 12 % of a symbol is a bit error waiting for the descrambler to
 * triple it. Host simulation puts the cost at roughly one frame in eight at 12
 * us, against zero for every AFSK profile.
 *
 * dac_ll_update_output_value() is a static inline in a HAL header, so it
 * compiles into this IRAM_ATTR ISR and the flash round trip disappears. Only
 * this ISR touches the DAC while the timer is running - AFSK_ServiceTx() and
 * afskDiagDacWrite() both check that TX is stopped first - so dropping the
 * driver's critical section here does not race anything.
 */
#if CONFIG_IDF_TARGET_ESP32
#include "hal/dac_ll.h"
#define MODEM_DAC_WRITE_IRAM 1
static inline void IRAM_ATTR dac_write_isr(uint8_t code) {
    dac_ll_update_output_value(MODEM_DAC_CHANNEL, code);
}
#else
#define MODEM_DAC_WRITE_IRAM 0
static inline void dac_write_isr(uint8_t code) {
    dac_oneshot_output_voltage(s_dac, code);
}
#endif

static bool IRAM_ATTR dac_timer_isr(gptimer_handle_t timer, const gptimer_alarm_event_data_t *edata, void *user_ctx) {
    (void)timer;
    (void)edata;
    (void)user_ctx;

    if (s_txActive) {
        uint8_t sinwave = MODEM_BAUDRATE_TIMER_HANDLER();
        dac_write_isr(dac_scale(sinwave));
    }
    return false;
}

/**
 * @brief Deferred TX teardown. Must run in task context.
 */
void AFSK_ServiceTx(void) {
    if (!s_txStopPending)
        return;

    /* s_txStopPending is cleared only after the teardown work below (and
     * setPtt(false) in particular) has run. Every reader of "is teardown
     * done" - ModemTxTeardownPending() / AFSK_TxTeardownPending(), and
     * therefore pollTxEvents()'s "PTT OFF (unkeyed)" log gate in ax25.c, plus
     * any getTransmit()-style guard - takes s_txStopPending == false as proof
     * the PTT GPIO has already been released. Clearing the flag last means
     * nothing can observe "teardown done" before the pin is genuinely idle. */

    if (s_dacTimer && s_dacTimerRunning) {
        gptimer_stop(s_dacTimer);
        s_dacTimerRunning = false;
    }
    if (s_dac)
        dac_oneshot_output_voltage(s_dac, DAC_MID); /* park the output at mid-scale */

    /* Half duplex only: the samples captured while we were keyed up are our own
     * transmission leaking back in, so throw them away. In full duplex the tail
     * of our own frame is still in the FIFO and must be demodulated - that is
     * exactly what the GPIO ADC -> GPIO DAC loopback test relies on. */
    if (!s_fullDuplex)
        AFSK_FlushFifo();

    setPtt(false);
    s_txStopPending = false; /* only now is teardown actually complete */
    ESP_LOGD(TAG, "TX stopped");
}

/* ------------------------------------------------------------------ */
/* ADC                                                                */
/* ------------------------------------------------------------------ */

/**
 * @brief ADC conversion-done callback.
 *
 * This runs in interrupt context and is therefore allowed to do exactly one
 * thing: count. Every microsecond spent here is a microsecond the DAC timer may
 * not get, and the modulator cannot survive a blackout longer than about 100 us
 * (see the ring buffer notes at the top of this file). The sample copy that used
 * to live here now runs in afsk_rx_task.
 *
 * The count is kept here rather than in adc_ingest() on purpose: it must report
 * the true hardware rate to modem_measure_adc_rate() even if the DSP task
 * falls behind and the driver drops a frame from the pool.
 */
static bool IRAM_ATTR adc_conv_done_cb(adc_continuous_handle_t handle, const adc_continuous_evt_data_t *edata, void *user_data) {
    (void)handle;
    (void)user_data;
    s_adcSamples += edata->size / SOC_ADC_DIGI_RESULT_BYTES;
    return false;
}

/*
 * The ESP32 hands back the two results in each 32-bit DMA word in the wrong
 * order, and the FIFO must undo it.
 *
 * On this chip the ADC is clocked through I2S0, which packs two 16-bit results
 * into one 32-bit DMA word and writes them out low half last. The sample stream
 * therefore arrives with every adjacent PAIR exchanged: t1 t0 t3 t2 t5 t4. It is
 * a fixed, known reordering, not a rate error.
 *
 * The three AFSK profiles are immune to it. They are demodulated at 9600 Hz, so
 * the 38400 -> 9600 decimation FIR averages each swapped pair back together
 * before the correlator ever sees it: exchanging two samples inside a filter
 * window does not change the window's output by anything the correlator can
 * measure.
 *
 * G3RUH is not decimated - it cannot be, its own bandwidth IS the anti-alias
 * cutoff - so it is handed the raw stream, four samples per 9600 Bd symbol,
 * with nothing in between to average the swap away. Whether that is survivable
 * depends on where the DMA word boundary happens to fall relative to the symbol
 * boundary:
 *
 *   pairs inside a symbol   [t0 t1][t2 t3]  -> harmless, both samples belong
 *                                              to the same symbol
 *   pairs across a symbol   t0[t1 t2][t3 t4] -> fatal: the last sample of one
 *                                              symbol and the first of the next
 *                                              trade places, so every symbol
 *                                              edge moves by +/-1 sample = +/-90
 *                                              degrees of symbol clock, and the
 *                                              DPLL is chasing an edge that
 *                                              zig-zags either side of where the
 *                                              symbol actually changed
 *
 * Nothing aligns those two boundaries. The DMA frame start bears no relation to
 * the transmitter's symbol phase, and the two clocks differ by ~17 Hz (38461.5
 * DAC vs 38444 ADC measured), so the alignment slips one sample about every 57
 * ms and walks through the fatal phase several times during a single frame.
 * One burst of bad bits is enough to fail the FCS, so without the un-swap the
 * G3RUH profile decodes nothing while the AFSK profiles are unaffected.
 *
 * Un-swap here, at ingest, so everything downstream - both demodulators, the
 * AGC, the DC tracker and afskDiagCaptureRaw() - sees samples in true time
 * order. Doing it here rather than in the G3RUH branch keeps stage 3 of the
 * diagnostics honest: it measures this FIFO's output, so if the un-swap is ever
 * wrong or is skipped on a future target, stage 3 reports "pair-swapped"
 * instead of leaving G3RUH to fail silently.
 *
 * ESP32 only. The S2/S3 ADC does not go through I2S and returns 4-byte results
 * in order.
 */
#if CONFIG_IDF_TARGET_ESP32
#define MODEM_ADC_DMA_PAIR_SWAP 1
#else
#define MODEM_ADC_DMA_PAIR_SWAP 0
#endif

/**
 * @brief Parse one conversion frame into the sample FIFO. Task context.
 */
#if MODEM_ADC_DMA_PAIR_SWAP
/*
 * adc_continuous_read() may hand back a partial frame (see the reassembly
 * note above afsk_rx_task), which can make `entries` below odd. A leftover
 * last entry is not passed through on its own: its real word partner is the
 * FIRST entry of the NEXT call, which has not arrived yet. It is held in
 * s_pendingSwap and paired with that entry when the next read comes in, so
 * the un-swap always follows the true DMA word boundary across reads instead
 * of slipping by one sample on an odd-length read.
 */
static bool s_havePendingSwap = false;
static adc_digi_output_data_t s_pendingSwap;
#endif

