hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
static void adc_ingest(const uint8_t *buf, uint32_t size) {
    /* Half duplex: do not fill the FIFO while transmitting, otherwise the
     * garbage captured during TX corrupts the demodulator state when drained. */
    if (!s_fullDuplex && s_txActive)
        return;

    uint32_t head = s_fifo.head;
    const uint32_t entries = size / SOC_ADC_DIGI_RESULT_BYTES;
    uint32_t start = 0;

#if MODEM_ADC_DMA_PAIR_SWAP
    if (s_havePendingSwap) {
        /* s_pendingSwap is the LATER sample of a word whose EARLIER sample
         * is the first entry of this call (if any arrived at all). Emit
         * them in true chronological order: earlier, then later. */
        if (entries > 0) {
            adc_digi_output_data_t *earlier = (adc_digi_output_data_t *)&buf[0];

            if (earlier->type1.channel == MODEM_ADC_CHANNEL && (head - s_fifo.tail) < MODEM_RX_FIFO_SIZE) {
                int16_t raw = (int16_t)earlier->type1.data;
                s_fifo.buffer[head & RB_MASK] = raw;
                s_fifo.head = ++head;
                if (s_capRaw && (s_capRawIdx < s_capRawLen))
                    s_capRaw[s_capRawIdx++] = raw;
            }
            if (s_pendingSwap.type1.channel == MODEM_ADC_CHANNEL && (head - s_fifo.tail) < MODEM_RX_FIFO_SIZE) {
                int16_t raw = (int16_t)s_pendingSwap.type1.data;
                s_fifo.buffer[head & RB_MASK] = raw;
                s_fifo.head = ++head;
                if (s_capRaw && (s_capRawIdx < s_capRawLen))
                    s_capRaw[s_capRawIdx++] = raw;
            }
            start = 1; /* buf[0] already consumed above */
        }
        /* If entries == 0 the pending entry simply waits for the next call;
         * it is not dropped. */
        s_havePendingSwap = false;
    }
#endif

    for (uint32_t i = start; i < entries; i++) {
        uint32_t n = i;

#if MODEM_ADC_DMA_PAIR_SWAP
        /* rel is this entry's position measured from the last confirmed
         * word boundary (start), not from the start of the raw buffer, so
         * a partial previous call can never desync the pairing. */
        uint32_t rel = i - start;

        if ((rel & 1u) == 0u) {
            if (i + 1 < entries) {
                n = i + 1;
            } else {
                /* Genuinely unpaired tail: hold it for the next call rather
                 * than emitting it unswapped. */
                s_pendingSwap = *(const adc_digi_output_data_t *)&buf[i * SOC_ADC_DIGI_RESULT_BYTES];
                s_havePendingSwap = true;
                continue;
            }
        } else {
            n = i - 1;
        }
#endif

        adc_digi_output_data_t *p = (adc_digi_output_data_t *)&buf[n * SOC_ADC_DIGI_RESULT_BYTES];

        if (p->type1.channel != MODEM_ADC_CHANNEL)
            continue;

        if ((head - s_fifo.tail) >= MODEM_RX_FIFO_SIZE)
            continue; /* overrun: drop rather than corrupt */

        int16_t raw = (int16_t)p->type1.data;
        s_fifo.buffer[head & RB_MASK] = raw;
        s_fifo.head = ++head;

        if (s_capRaw && (s_capRawIdx < s_capRawLen))
            s_capRaw[s_capRawIdx++] = raw;
    }
}

static esp_err_t adc_start_continuous(void) {
    /*
     * conv_frame_size is NOT MODEM_BLOCK_SIZE, on purpose. It is the length
     * of the memcpy the IDF's ADC ISR performs inside portENTER_CRITICAL_ISR(),
     * and therefore the length of time the DAC sample clock is masked on that
     * core - see the ring buffer notes at the top of this file. Small frames,
     * deep pool; AFSK_Poll() reassembles MODEM_BLOCK_SIZE blocks from the
     * FIFO downstream.
     */
    uint32_t conv_frame_size = (uint32_t)MODEM_ADC_CONV_FRAME_BYTES;

    adc_continuous_handle_cfg_t handleCfg = {
        .max_store_buf_size = conv_frame_size * MODEM_ADC_POOL_FRAMES,
        .conv_frame_size = conv_frame_size,
    };
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
    handleCfg.flags.flush_pool = true;
#endif

    esp_err_t err = adc_continuous_new_handle(&handleCfg, &s_adc);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "adc_continuous_new_handle: %s", esp_err_to_name(err));
        return err;
    }

    adc_digi_pattern_config_t pattern = {
        .atten = MODEM_ADC_ATTEN,
        .channel = MODEM_ADC_CHANNEL,
        .unit = ADC_UNIT_1,
        .bit_width = SOC_ADC_DIGI_MAX_BITWIDTH,
    };

    adc_continuous_config_t cfg = {
        .sample_freq_hz = (uint32_t)MODEM_ADC_SAMPLERATE * MODEM_ADC_RATE_NUM / MODEM_ADC_RATE_DEN,
        .conv_mode = ADC_CONV_SINGLE_UNIT_1,
        .format = ADC_DIGI_OUTPUT_FORMAT_TYPE1,
        .pattern_num = 1,
        .adc_pattern = &pattern,
    };

    err = adc_continuous_config(s_adc, &cfg);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "adc_continuous_config: %s", esp_err_to_name(err));
        return err;
    }
    ESP_LOGI(TAG, "ADC1 CH%d (GPIO%d) requested %" PRIu32 " Hz -> nominal %d Hz", (int)MODEM_ADC_CHANNEL, MODEM_ADC_GPIO, cfg.sample_freq_hz,
             MODEM_ADC_SAMPLERATE);
    /* Print the frame size in the unit that matters. The driver's ISR copies
     * this many bytes with interrupts masked to level 3; if the DAC clock ever
     * shares this core again, that is its worst-case freeze. */
    ESP_LOGI(TAG, "ADC DMA: %d samples/frame (%d B, %.2f ms), pool %d frames (%.1f ms), ISR on core %d", MODEM_ADC_CONV_FRAME, MODEM_ADC_CONV_FRAME_BYTES,
             1000.0 * MODEM_ADC_CONV_FRAME / (double)MODEM_ADC_SAMPLERATE, MODEM_ADC_POOL_FRAMES,
             1000.0 * MODEM_ADC_CONV_FRAME * MODEM_ADC_POOL_FRAMES / (double)MODEM_ADC_SAMPLERATE, MODEM_ADC_ISR_CORE);

    adc_continuous_evt_cbs_t cbs = { .on_conv_done = adc_conv_done_cb };
    err = adc_continuous_register_event_callbacks(s_adc, &cbs, NULL);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "adc_continuous_register_event_callbacks: %s", esp_err_to_name(err));
        return err;
    }

    adc_cali_line_fitting_config_t caliCfg = {
        .unit_id = ADC_UNIT_1,
        .atten = MODEM_ADC_ATTEN,
        .bitwidth = ADC_BITWIDTH_12,
    };
    err = adc_cali_create_scheme_line_fitting(&caliCfg, &s_cali);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "adc_cali_create_scheme_line_fitting: %s", esp_err_to_name(err));
        return err;
    }

    return adc_continuous_start(s_adc);
}

