hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
/* ------------------------------------------------------------------ */
/* Modem profile                                                      */
/* ------------------------------------------------------------------ */

void afskSetModem(uint8_t val, bool flatAudio, uint16_t timeSlot, uint16_t preamble, uint8_t fx25Mode, uint16_t minUnkeyMs) {
    /*
     * afsk_rx_task runs continuously on its own (possibly pinned) core,
     * calling AFSK_Poll() -> MODEM_DECODE() -> demodulate() -> filterRun()
     * on whatever is currently in demodState[]. ModemInit() below does a
     * memset() of demodState[] followed by piecemeal reassignment of each
     * filter's coeffs/taps. If the RX task runs concurrently with that, it
     * can observe a torn/inconsistent DemodState (e.g. a stale nonzero
     * `taps` paired with a just-cleared NULL `coeffs`), which crashes
     * filterRun() with a NULL-pointer read. Suspend the RX task for the
     * duration of the reinit so no profile switch can race it.
     */
    if (s_rxTask)
        vTaskSuspend(s_rxTask);

    ModemConfig.flatAudioIn = flatAudio ? 1 : 0;
    ModemConfig.usePWM = 1;

    // val is the modem_mode_t selector (0=AFSK300, 1=Bell202, 2=V.23, 3=G3RUH);
    // out-of-range values fall back to standard-APRS Bell202.
    ModemConfig.modem = (val <= MODEM_MODEM_G3RUH) ? (modem_mode_t)val : MODEM_MODEM_BELL202;

    ESP_LOGI(TAG, "modem=%d adcRate=%d blockSize=%d resample=%d demodRate=%d", (int)ModemConfig.modem, MODEM_ADC_SAMPLERATE, MODEM_BLOCK_SIZE,
             MODEM_RESAMPLE_RATIO, MODEM_DEMOD_SAMPLERATE);

    ModemInit();
    Ax25Init(fx25Mode);
    Ax25Config.fullDuplex = s_fullDuplex ? 1 : 0;
#ifdef ENABLE_FX25
    if (fx25Mode > 0)
        Fx25Init();
#endif
    Ax25TimeSlot(timeSlot);
    Ax25TxDelay(preamble);
    Ax25MinUnkeyTime(minUnkeyMs);

    /* Reset the RX front-end so a profile change cannot leak old state. */
    memset(s_avgBuf, 0, sizeof(s_avgBuf));
    s_avgIdx = 0;
    s_avgSum = 0;
    s_avg = 2048;
    s_agcGain = 1.0f;
    s_dcdCnt = 0;
    AFSK_FlushFifo();

    if (s_rxTask)
        vTaskResume(s_rxTask);
}

/* ------------------------------------------------------------------ */
/* Core-pinned bring-up                                               */
/* ------------------------------------------------------------------ */

/*
 * esp_intr_alloc() binds an interrupt to whichever core calls it. Both the ADC
 * DMA interrupt and the DAC GPTimer interrupt are allocated inside driver calls
 * (adc_continuous_new_handle() and gptimer_register_event_callbacks()
 * respectively), which put both of them on core 0.
 *
 * run_on_core() removes the accident. esp_ipc_call_blocking() would be the
 * obvious tool, but CONFIG_ESP_IPC_TASK_STACK_SIZE defaults to 1024 bytes and
 * these callees allocate, log and touch the interrupt tables; a throwaway
 * pinned task with a real stack is both safer and easier to reason about.
 *
 * Teardown does not need this: esp_intr_free() detects a cross-core call and
 * IPCs itself to the right core, and esp_intr_enable()/disable() go through the
 * interrupt matrix for peripheral sources, which works from either core.
 */
typedef struct {
    esp_err_t (*fn)(void);
    esp_err_t err;
    TaskHandle_t caller;
} core_call_t;

static void core_call_task(void *arg) {
    core_call_t *c = (core_call_t *)arg;

    c->err = c->fn();
    xTaskNotifyGive(c->caller);
    vTaskDelete(NULL);
}

static esp_err_t run_on_core(int core, esp_err_t (*fn)(void)) {
#if CONFIG_FREERTOS_UNICORE
    (void)core;
    return fn();
#else
    if ((core < 0) || (core >= CONFIG_FREERTOS_NUMBER_OF_CORES) || (core == xPortGetCoreID()))
        return fn(); /* already there, or no preference expressed */

    core_call_t call = { .fn = fn, .err = ESP_FAIL, .caller = xTaskGetCurrentTaskHandle() };

    if (xTaskCreatePinnedToCore(core_call_task, "modem_init", 4096, &call, configMAX_PRIORITIES - 2, NULL, core) != pdPASS) {
        ESP_LOGE(TAG, "cannot create the bring-up task for core %d", core);
        return ESP_ERR_NO_MEM;
    }

    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    return call.err;
#endif
}

/* ------------------------------------------------------------------ */
/* Init / deinit                                                      */
/* ------------------------------------------------------------------ */

/**
 * @brief Create, configure and enable the DAC sample clock.
 *
 * MUST run on MODEM_DAC_TIMER_CORE: gptimer_register_event_callbacks() is
 * where the interrupt is actually allocated, and esp_intr_alloc() binds to the
 * calling core.
 *
 * Why the core matters at all, given intr_priority 3 is the highest an IDF C
 * handler can have: because portENTER_CRITICAL_ISR() masks to level 3. Level 3
 * is not "above" critical sections, it is exactly what they mask. Any driver
 * ISR on this core that takes a spinlock silences the modulator for as long as
 * it holds it, and the ADC's holds one across a whole conversion frame. A
 * spinlock only raises INTLEVEL on its own core, so the cure is separation, not
 * priority. Everything else about this handler - IRAM_ATTR, DRAM_ATTR tables,
 * the direct dac_ll write - remains necessary; it just was not the last thing
 * blocking it.
 */
static esp_err_t dac_timer_create(void) {
    esp_err_t err;

    /*
     * The resolution stays at 10 MHz. 10000000 / 38400 = 260.4 truncates to 260
     * ticks, so the timer really runs at 38461.5 Hz, +0.16 % above the rate
     * modem.c derives its steps from. That is deliberate: 38400 Hz cannot be
     * hit exactly from the 80 MHz APB at any divider (80e6 / 38400 = 2083.33),
     * and a uniform rate error of that size is nothing - the demodulator's DPLL
     * tracks a full 1.7 % of it without dropping a frame. It is bursty stalls,
     * not rate error, that this modem dies of.
     */
    gptimer_config_t timerCfg = {
        .clk_src = GPTIMER_CLK_SRC_DEFAULT,
        .direction = GPTIMER_COUNT_UP,
        .resolution_hz = 10 * 1000 * 1000, /* 10 MHz, 1 tick = 100 ns */
        .intr_priority = MODEM_DAC_TIMER_INTR_PRIO,
    };
    err = gptimer_new_timer(&timerCfg, &s_dacTimer);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "gptimer_new_timer: %s", esp_err_to_name(err));
        return err;
    }

